In [15]:
import pandas as pd

In [19]:
# global recoding on age and pram on sex 
anon_data_global_recoding_pram = pd.read_excel("anon_data/anon_data_global_recoding_pram.xlsx")
# global recoding on age, global recoding on marital status 
anon_data_global2 = pd.read_excel("anon_data/anon_data_global2.xlsx")
# global recodign on age, global recoding on marital status, and pram on sex 
anon_data_global2_pram = pd.read_excel("anon_data/anon_data_global2_pram.xlsx")

results_data = pd.read_excel("data/public_data_resultsE.xlsx")
pub_data_register = pd.read_excel('data/public_data_registerE.xlsx')
anon_data_global_recoding_pram

,sex,evote,zip,education,citizenship,marital_status,party,age_group
0,Female,0,2400,Vocational bachelors educations,Denmark,Never married,Red,"(38,48]"
1,Male,1,2200,Masters programmes,Denmark,Married/separated,Green,"(30,38]"
2,Male,1,2200,Vocational bachelors educations,Denmark,Never married,Green,"(18,30]"
3,Female,0,2200,Vocational Education and Training (VET),Denmark,Divorced,Green,"(58,70]"
4,Male,0,2200,Vocational Education and Training (VET),Denmark,Divorced,Green,"(58,70]"
...,...,...,...,...,...,...,...,...
195,Female,0,2200,Vocational Education and Training (VET),Denmark,Married/separated,Green,"(58,70]"
196,Female,0,2400,Vocational Education and Training (VET),Denmark,Married/separated,Green,"(58,70]"
197,Male,1,2300,Primary education,Denmark,Never married,Green,"(18,30]"
198,Female,0,2200,Primary education,Stateless,Never married,Green,"(18,30]"
199,Female,1,2200,Vocational Education and Training (VET),Denmark,Married/separated,Green,"(70,101]"

In [24]:
grouped = anon_data_global_recoding_pram.groupby(["zip", "age_group", "citizenship", "marital_status"]).count()
counts = grouped['party'].value_counts()
quasi_identifiers = ["zip", "age_group", "citizenship", "marital_status"]
k = 2

# Group by the quasi-identifiers and count the occurrences of each group
grouped = anon_data_global_recoding_pram.groupby(quasi_identifiers).size().reset_index(name='count')

# Filter the groups that have fewer than k occurrences (k-anonymity violations)
violations = grouped[grouped['count'] < k]

# Count the total number of records in k-anonymity violation groups
num_violations = violations['count'].sum()
num_violations

30

In [18]:
grouped

                                              sex  evote  education  party
zip  age_group citizenship marital_status
2100 (18,30]   Denmark     Married/separated    2      2          2      2
                           Never married       13     13         13     13
               USA         Never married        1      1          1      1
     (30,38]   Denmark     Married/separated    2      2          2      2
                           Never married        4      4          4      4
...                                           ...    ...        ...    ...
2400 (58,70]   Poland      Married/separated    1      1          1      1
     (70,101]  Denmark     Married/separated    4      4          4      4
                           Never married        2      2          2      2
                           Widowed              6      6          6      6
               USA         Married/separated    1      1          1      1

[73 rows x 4 columns]